---
kind: other
id: Methods.T:Autodesk.Revit.DB.KeynoteTable
source: html/cbb7e220-6c7f-b961-75b2-ee5e86061513.htm
---
# KeynoteTable Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.